{
  "common": {
    "name": "onvif",
    "version": "1.0.3",
    "news": {
      "1.0.3": {
        "en": "Minor bugfixes",
        "de": "Kleine Fehlerbehebungen"
      },
      "1.0.2": {
        "en": "Fixed a reonnect and empty event bug",
        "de": "Fehler bei der Wiederverbindung und leerem Events behoben"
      },
      "1.0.1": {
        "en": "New Adapter. Adapter was rewritten please read the new README",
        "de": "Neuer Adapter. Adapter wurde neu geschrieben, bitte lesen Sie die neue README",
        "ru": "Новый адаптер. Адаптер был переписан, пожалуйста, прочитайте новый README",
        "pt": "Novo adaptador. Adapter foi reescrito por favor leia o novo README",
        "nl": "Nieuwe Adapter. Adapter is herschreven, lees alsjeblieft de nieuwe ReadME",
        "fr": "Nouveau Adaptateur. L'adaptateur a été réécrit s'il vous plaît lire la nouvelle README",
        "it": "Nuovo adattatore. L'adattatore è stato riscritto si prega di leggere il nuovo README",
        "es": "Nuevo Adaptador. Adaptador fue reescrito por favor lea el nuevo README",
        "pl": "New Adapter (ang.). Adapter został ponownie napisany i odczytany jako nowy README",
        "uk": "Новий адаптер. Переписаний адаптер, будь ласка, ознайомтесь з новим README",
        "zh-cn": "新协定。 希望改写新版的中小企业"
      }
    },
    "titleLang": {
      "en": "Onvif",
      "de": "Onvif",
      "ru": "Онвиф",
      "pt": "onvif",
      "nl": "Onvif",
      "fr": "Onvif",
      "it": "Onvif",
      "es": "Onvif",
      "pl": "Onvif",
      "uk": "Onvif",
      "zh-cn": "Onvif"
    },
    "desc": {
      "en": "Adapter for onvif cameras",
      "de": "Adapter für Onvif-Kameras",
      "ru": "Адаптер для онвиф камер",
      "pt": "Adaptador para câmeras onvif",
      "nl": "Adapter voor onvif-camera's",
      "fr": "Adaptateur pour caméras onvif",
      "it": "Adattatore per telecamere onvif",
      "es": "Adaptador para cámaras onvif",
      "pl": "Adapter do kamer onvif",
      "zh-cn": "onvif 相机适配器"
    },
    "authors": ["TA2k <tombox2020@gmail.com>"],
    "keywords": ["onvif", "camera"],
    "license": "MIT",
    "platform": "Javascript/Node.js",
    "main": "main.js",
    "icon": "onvif.png",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/iobroker-community-adapters/ioBroker.onvif/main/admin/onvif.png",
    "readme": "https://github.com/iobroker-community-adapters/ioBroker.onvif/blob/main/README.md",
    "loglevel": "info",
    "mode": "daemon",
    "type": "infrastructure",
    "compact": true,
    "connectionType": "local",
    "messagebox": true,
    "dataSource": "push",
    "plugins": {
      "sentry": {
        "dsn": "https://802f699c7aa84a62b0bcb54b31485352@sentry.iobroker.net/226"
      }
    },
    "adminUI": {
      "config": "json"
    },
    "dependencies": [
      {
        "js-controller": ">=3.3.22"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=5.2.28"
      }
    ]
  },
  "protectedNative": ["password"],
  "native": {
    "user": "admin",
    "password": "admin",
    "activateServer": false,
    "useHighRes": false,
    "serverPort": 8095
  },
  "messages": [
    {
      "condition": {
        "operand": "and",
        "rules": ["oldVersion<1.0.0", "newVersion>=1.0.0"]
      },
      "title": {
        "en": "Important notice!",
        "de": "Wichtiger Hinweis!",
        "ru": "Важное замечание!",
        "pt": "Notícia importante!",
        "nl": "Belangrijke mededeling!",
        "fr": "Avis important!",
        "it": "Avviso IMPORTANTE!",
        "es": "Noticia importante!",
        "pl": "Ważna uwaga!",
        "zh-cn": "重要通知!"
      },
      "text": {
        "en": "The adapter was completely rewritten and the event objects were changed. With the update, all recognized cameras are deleted and must be found again.",
        "de": "Der Adapter wurde komplett neu geschrieben und die Ereignisobjekte wurden geändert. Mit dem Update werden alle erkannten Kameras gelöscht und müssen erneut gesucht werden.",
        "ru": "Адаптер был полностью переписан, и объекты мероприятия были изменены. С обновлением все признанные камеры удаляются и должны быть найдены снова.",
        "pt": "O adaptador foi completamente reescrito e os objetos do evento foram alterados. Com a atualização, todas as câmeras reconhecidas são excluídas e devem ser encontradas novamente.",
        "nl": "De adapter was volledig herschreven en de voorwerpen werden veranderd. Met de update zijn alle herkende camera's verwijderd en moeten we weer gevonden worden.",
        "fr": "L'adaptateur a été entièrement réécrit et les objets de l'événement ont été changés. Avec la mise à jour, tous les appareils photo reconnus sont supprimés et doivent être retrouvés à nouveau.",
        "it": "L'adattatore è stato completamente riscritto e gli oggetti dell'evento sono stati modificati. Con l'aggiornamento, tutte le telecamere riconosciute vengono eliminate e devono essere trovate di nuovo.",
        "es": "El adaptador fue completamente reescrito y los objetos del evento fueron cambiados. Con la actualización, todas las cámaras reconocidas se eliminan y deben ser encontradas de nuevo.",
        "pl": "Adaptator został całkowicie przepisany, a obiekty zdarzenia zostały zmienione. Wraz z aktualizacją wszystkie rozpoznawane kamery są usuwane i muszą zostać ponownie odnalezione.",
        "uk": "Перехідник повністю повторився, а об’єкти заходу були змінені. З оновленням всі визначені камери видаляються і повинні бути знайдені знову.",
        "zh-cn": "适应者完全被改写,活动物品也发生了变化。 更新后,所有公认的摄像机都被删除,必须再次发现。."
      },
      "level": "warn",
      "buttons": ["agree", "cancel"]
    }
  ],
  "objects": [],
  "instanceObjects": []
}
